[
  {
    "_id": "6491f9e9f6b6d2f3e4a2a8p1",
    "title": "Bookquest",
    "image": "Bookquest.png",
    "date": "November 2024",
    "description": [
      "This is an innovative online library platform that lets you store, track, and discover books that matter to you. Designed for passionate readers or anyone beginning their literary journey, BookQuest provides a simple yet powerful way to organize your reading life. With features like a personal library, powerful filters, and a detailed reading profile, it makes managing your literary world effortless and enjoyable.",
      "In this project, I applied key concepts in both front-end and back-end development. Using React to build a single-page application (SPA), I created dynamic, interactive components that offer a smooth user experience. On the back-end, I implemented SQL database relations with Supabase, connecting the front-end to the database with seamless integration. I used full CRUD operations to allow users to create, read, update, and delete their books and profiles. Additionally, I learned to manage complex relationships between users, books, and book statuses, ensuring data consistency and an efficient flow of information.",
      "This project significantly enhanced my understanding of integrating front-end technologies with back-end systems, as well as managing data in a real-world application.",
      "Feel free to check out the Project by visiting the Project Link."
    ],
    "technologies": ["Supabase", "Axios", "React", "Git"],
    "link": "https://thebookquest.netlify.app/"
  },
  {
    "_id": "6491f9e9f6b6d2f3ef5ds832p2",
    "title": "Isibcn",
    "image": "IsiBcn.png",
    "date": "December 2024",
    "description": [
      "Isibcn is a sleek and elegant e-commerce platform designed for showcasing and selling jewelry. This project focuses on delivering a captivating user experience through a dynamic homepage featuring a hero video and a curated list of jewelry products. The site seamlessly combines functionality and aesthetics, providing users with a visually appealing and intuitive shopping experience.",
      "Developed in collaboration with a UX/UI design team during an intensive two-day sprint, the project aimed to create a Minimum Viable Product (MVP) that highlights key features. The homepage includes a detailed Jewels List, featuring large product images, titles, prices, descriptions, and a visual representation of the creation process. Interactive elements like a quantity counter and an Add to Cart button ensure a user-friendly shopping journey.",
      "This project offered valuable insights into working in a real-world development environment. Collaborating closely with designers to solve problems and refine solutions emphasized the importance of teamwork and adaptability. The experience of rapidly developing an MVP in just two days underscored the significance of efficient planning and execution in a fast-paced project setting.",
      "Feel free to check out the Project by visiting the Project Link."
    ],
    "technologies": ["React", "Git"],
    "link": "https://isibcn.netlify.app/"

  },
  {
    "_id": "6491f9e9f6b6d2bka4da42f3e4a2a8p3",
    "title": "IronHub",
    "image": "Ironhub.png",
    "date": "December 2024",
    "description": [
      "IronHub is a dedicated platform designed to bring together Ironhack students from Web Development, Data Analytics, and UX/UI courses. It serves as a space for students to share knowledge, connect with peers, and grow their skills through collaboration and discussion. Whether you’re looking to seek help, contribute to a topic, or simply connect with others, IronHub is the place to enhance your Ironhack experience.",
      "This project was a comprehensive end-to-end solution built using the MERN stack, integrating both front-end and back-end development with full CRUD operations. I used React to create a Single Page Application (SPA), enabling dynamic content updates without full page reloads. Key features included user authentication with JWT and secure route protection. I also developed a post management system that allowed users to create, update, and delete posts, with a filtering and sorting system for easier navigation.",
      "On the back-end, I worked with Node.js and Express to set up the API and manage the database using MongoDB. I learned to implement data validation and error handling, ensuring smooth communication between the front-end and back-end. Additionally, I deepened my understanding of how to structure RESTful APIs and interact with the database to retrieve and update data efficiently.",
      "IronHub also includes user profiles, enabling students to update their personal information and view their own posts. This feature was essential for managing user data and reinforced my understanding of securely connecting the front-end to the back-end while maintaining user sessions and data integrity.",
      "Building IronHub was a significant learning experience that allowed me to apply my knowledge of the MERN stack in a real-world context. I gained hands-on experience in creating and deploying a full-stack application, from developing the front-end with React to implementing user authentication and managing data storage on the back-end. Completing the project not only strengthened my technical abilities but also led to it being recognized as the best project in our bootcamp class.",
      "Feel free to check out the Project by visiting the Project Link."
    ],
    "technologies": [
      "MongoDB",
      "Express.js",
      "React.js",
      "Node.js",
      "bcrypt",
      "Cloudinary",
      "Git"
    ],
    "link": "https://ironhub-front.netlify.app/"
  }
]
